Repository: crystal-jp/ja.crystal-lang.org-omegat
Catalog: crystal-jp-gh-pages-level2.tmx
Source language: en_us
Languages: ja

source: # A proc with one argument ->(x : Int32) { x.to_s } # Proc(Int32, String)
ja: # 引数を1つ持つ Proc ->(x : Int32) { x.to_s } # Proc(Int32, String)

source: # A proc with two arguments: ->(x : Int32, y : Int32) { x + y } # Proc(Int32, Int32, Int32) ```
ja: # 引数を2つ持つ Proc ->(x : Int32, y : Int32) { x + y } # Proc(Int32, Int32, Int32) ```

source: # An indexed assignment objects.[]=(2, 3)
ja: # インデックスを指定した代入 objects.[]=(2, 3)

source: # Array
ja: # 配列 (Array)

source: # Assignment
ja: # 代入

source: # Assigns to a class variable @@class = 3
ja: # クラス変数への代入 @@class = 3

source: # Assigns to a global variable $global = 4 ```
ja: # グローバル変数への代入 $global = 4 ```

source: # Assigns to an instance variable @instance = 2
ja: # インスタンス変数への代入 @instance = 2

source: # Bool
ja: # 真偽値 (Bool)

source: # Char
ja: # 文字 (Char)

source: # Comments
ja: # コメント

source: # Crystal Programming Language
ja: # プログラミング言語 Crystal

source: # Ending with question and exclamation marks :question? :exclamation!
ja: # 名前が ? や ! で終わるシンボル :question? :exclamation!

source: # Floats
ja: # 浮動小数点数 (Float)

source: # For the operators :+ :- :* :/ :== :< :<= :> :>= :! :!= :=~ :!~ :& :| :^ :~ :** :>> :<< :% :[] :[]? :[]= :<=> :=== ```
ja: # 演算子 :+ :- :* :/ :== :< :<= :> :>= :! :!= :=~ :!~ :& :| :^ :~ :** :>> :<< :% :[] :[]? :[]= :<=> :=== ```

source: # From a tar.gz
ja: # tar.gz からインストール

source: # From sources
ja: # ソースコードからインストール

source: # Global variables
ja: # グローバル変数

source: # HTTP Server
ja: # HTTP サーバー

source: # Hash
ja: # ハッシュ (Hash)

source: # Installation
ja: # インストール

source: # Integers
ja: # 整数 (Integer)

source: # Literals
ja: # リテラル

source: # Local variables
ja: # ローカル変数

source: # Multiple assignment
ja: # 多重代入

source: # Not assignment-related, but also syntax sugar: objects.[](2, 3)
ja: # 代入ではないが、以下のシンタックスシュガーも有効 objects.[](2, 3)

source: # On Debian and Ubuntu
ja: # Debian や Ubuntu

source: # On Mac OSX using Homebrew
ja: # Mac OS X (Homebrew を利用)

source: # On RedHat and CentOS
ja: # RedHat や CentOS

source: # Overview
ja: # 概要

source: # Range
ja: # 範囲 (Range)

source: # Regex
ja: # 正規表現 (Regex)

source: # Same as: temp1 = "John" temp2 = 32 person.name = temp1 person.age = temp2 ```
ja: # 上記は以下と同じ temp1 = "John" temp2 = 32 person.name = temp1 person.age = temp2 ```

source: # Same as: temp1 = 3 temp2 = 4 objects[1] = temp1 objects[2] = temp2 ```
ja: # 上記は以下と同じ temp1 = 3 temp2 = 4 objects[1] = temp1 objects[2] = temp2 ```

source: # String
ja: # 文字列 (String)

source: # Supports double quotes and nested angles %<hello <"world">> # same as "hello <\"world\">" ```
ja: # ダブルクォートと入れ子の山カッコ (アングルブラケット) を含む %<hello <"world">> # "hello <\"world\">" と同じ ```

source: # Supports double quotes and nested brackets %[hello ["world"]] # same as "hello [\"world\"]"
ja: # ダブルクォートと入れ子の角カッコ (ブラケット) を含む %[hello ["world"]] # "hello [\"world\"]" と同じ

source: # Supports double quotes and nested curlies %{hello {"world"}} # same as "hello {\"world\"}"
ja: # ダブルクォートと入れ子の波カッコ (ブレース) を含む %{hello {"world"}} # "hello {\"world\"}" と同じ

source: # Symbol
ja: # シンボル (Symbol)

source: # Syntax and Semantics
ja: # シンタックスとセマンティクス

source: # The above can be written as: objects[2, 3] ```
ja: # 上記は以下のように書くことができる objects[2, 3] ```

source: # The above can be written as: objects[2] = 3
ja: # 上記は以下のように書くことができる objects[2] = 3

source: # The above can be written as: person.name = "John"
ja: # 上記は以下のように書くことができる person.name = "John"

source: # The above is the same as this: temp = "Crystal,1,github".split(",") name = temp[0] age = temp[1] source = temp[2] ```
ja: # 上記は以下と同じ temp = "Crystal,1,github".split(",") name = temp[0] age = temp[1] source = temp[2] ```

source: # The above is the same as this: temp1 = "Crystal" temp2 = 1 name = temp1 age = temp2 ```
ja: # 上記は以下と同じ temp1 = "Crystal" temp2 = 1 name = temp1 age = temp2 ```

source: # The above is the same as: names = ["John", "Peter", "Jack"] ```
ja: # 上記は以下と同じ names = ["John", "Peter", "Jack"] ```

source: # The above is valid with these operators: # +, -, *, /, %, |, &, ^, **, <<, >>
ja: # 上記は以下の演算子でも有効 # +, -, *, /, %, |, &, ^, **, <<, >>

source: # Tuple
ja: # タプル (Tuple)

source: # Using the compiler
ja: # コンパイラを使用する

source: # With spaces and symbols :"symbol with spaces"
ja: # 名前にスペースを含むシンボル :"symbol with spaces"

source: ## Array of String
ja: ## 文字列の配列

source: ## Array of Symbol
ja: ## シンボルの配列

source: ## Array-like types
ja: ## 配列ライクな型

source: ## Compiling and running at once
ja: ## コンパイルと同時に実行する

source: ## Creating a project or library
ja: ## プロジェクトやライブラリの作成

source: ## Creating an executable
ja: ## 実行ファイルの作成

source: ## From methods
ja: ## メソッドから Proc を生成する

source: ## Hash-like types
ja: ## ハッシュライクな型

source: ## Install Once the repository is configured you're ready to install Crystal:
ja: ## インストール リポジトリの構成が完了すると、Crystal をインストールすることができます。

source: ## Interpolation
ja: ## String Interpolation

source: ## Invoking
ja: ## Proc の実行

source: ## Other commands and options
ja: ## その他のコマンドやオプション

source: ## Setup repository
ja: ## リポジトリの設定

source: ## String keys
ja: ## キーが文字列のハッシュ

source: ## Symbol keys
ja: ## キーがシンボルのハッシュ

source: ## Upgrade
ja: ## アップグレード

source: * You can [require](../syntax_and_semantics/requiring_files.html) code defined in other files:
ja: * [require](../syntax_and_semantics/requiring_files.html) で、他のファイルで定義されたコードを読み込むことができます

source: * You can easily create strings with embedded content, known as string interpolation.
ja: * 文字列埋め込み (string interpolation) を使うと、簡単に文字列に式を埋め込むことができます。

source: * You can use code blocks, or simply [blocks](../syntax_and_semantics/blocks_and_procs.html), which are a very convenient way to reuse code and get some features from the functional world:
ja: * [ブロック](../syntax_and_semantics/blocks_and_procs.html)を使うと簡単にコードを再利用することができ、また、関数型の世界にあるいくつかの機能を利用することが可能になります

source: * You program by invoking [methods](../syntax_and_semantics/classes_and_methods.html) (or sending messages) to objects.
ja: * オブジェクトに対して[メソッド](../syntax_and_semantics/classes_and_methods.html)を実行 (またはメッセージを送信) することでプログラムを構築します

source: * [Array](syntax_and_semantics/literals/array.md)
ja: * [配列 (Array)](syntax_and_semantics/literals/array.md)

source: * [Assignment](syntax_and_semantics/assignment.md)
ja: * [代入](syntax_and_semantics/assignment.md)

source: * [Bool](syntax_and_semantics/literals/bool.md)
ja: * [真偽値 (Bool)](syntax_and_semantics/literals/bool.md)

source: * [Char](syntax_and_semantics/literals/char.md)
ja: * [文字 (Char)](syntax_and_semantics/literals/char.md)

source: * [Comments](syntax_and_semantics/comments.md)
ja: * [コメント](syntax_and_semantics/comments.md)

source: * [Floats](syntax_and_semantics/literals/floats.md)
ja: * [浮動小数点数 (Float)](syntax_and_semantics/literals/floats.md)

source: * [From a tar.gz](installation/from_a_targz.md)
ja: * [Ftar.gz からインストール](installation/from_a_targz.md)

source: * [From sources](installation/from_source_repository.md) * [Using the compiler](using_the_compiler/README.md) * [Overview and Examples](overview/README.md)
ja: * [ソースコードからインストール](installation/from_source_repository.md) * [コンパイラを使用する](using_the_compiler/README.md) * [概要とプログラム例](overview/README.md)

source: * [Global variables](syntax_and_semantics/global_variables.md)
ja: * [グローバル変数](syntax_and_semantics/global_variables.md)

source: * [HTTP Server](overview/http_server.md) * [Syntax and semantics](syntax_and_semantics/README.md)
ja: * [HTTP サーバー](overview/http_server.md) * [シンタックスとセマンティクス](syntax_and_semantics/README.md)

source: * [Hash](syntax_and_semantics/literals/hash.md)
ja: * [ハッシュ (Hash)](syntax_and_semantics/literals/hash.md)

source: * [Integers](syntax_and_semantics/literals/integers.md)
ja: * [整数 (Integer)](syntax_and_semantics/literals/integers.md)

source: * [Introduction](README.md) * [Installation](installation/README.md)
ja: * [はじめに](README.md) * [インストール](installation/README.md)

source: * [Literals](syntax_and_semantics/literals.md)
ja: * [リテラル](syntax_and_semantics/literals.md)

source: * [Local variables](syntax_and_semantics/local_variables.md)
ja: * [ローカル変数](syntax_and_semantics/local_variables.md)

source: * [Multiple assignment](syntax_and_semantics/multiple_assignment.md)
ja: * [多重代入](syntax_and_semantics/multiple_assignment.md)

source: * [On Debian And Ubuntu](on_debian_and_ubuntu.html) * [On RedHat And CentOS](on_redhat_and_centos.html) * [On Mac OSX using Homebrew](on_mac_osx_using_homebrew.html) * [From a tar.gz](from_a_targz.html) * [From sources](from_source_repository.html)
ja: * [Debian や Ubuntu](on_debian_and_ubuntu.html) * [RedHat や CentOS](on_redhat_and_centos.html) * [Mac OS X (Homebrew を利用)](on_mac_osx_using_homebrew.html) * [tar.gz からインストール](from_a_targz.html) * [ソースコードからインストール](from_source_repository.html)

source: * [On Debian and Ubuntu](installation/on_debian_and_ubuntu.md)
ja: * [Debian や Ubuntu](installation/on_debian_and_ubuntu.md)

source: * [On Mac OSX using Homebrew](installation/on_mac_osx_using_homebrew.md)
ja: * [Mac OS X (Homebrew を利用)](installation/on_mac_osx_using_homebrew.md)

source: * [On RedHat and CentOS](installation/on_redhat_and_centos.md)
ja: * [RedHat や CentOS](installation/on_redhat_and_centos.md)

source: * [Range](syntax_and_semantics/literals/range.md)
ja: * [範囲 (Range)](syntax_and_semantics/literals/range.md)

source: * [Regex](syntax_and_semantics/literals/regex.md)
ja: * [正規表現 (Regex)](syntax_and_semantics/literals/regex.md)

source: * [String](syntax_and_semantics/literals/string.md)
ja: * [文字列 (String)](syntax_and_semantics/literals/string.md)

source: * [Symbol](syntax_and_semantics/literals/symbol.md)
ja: * [シンボル (Symbol)](syntax_and_semantics/literals/symbol.md)

source: * [Tuple](syntax_and_semantics/literals/tuple.md)
ja: * [タプル (Tuple)](syntax_and_semantics/literals/tuple.md)

source: * i: ignore case (PCRE_CASELESS) * m: multiline (PCRE_MULTILINE) * x: extended (PCRE_EXTENDED)
ja: * i: 大小文字を区別しない (PCRE_CASELESS) * m: 複数行のマッチング (PCRE_MULTILINE) * x: 拡張 (PCRE_EXTENDED)

source: **Note:** By default the generated executables **are not fully optimized**.
ja: **注意:** デフォルトでは生成された実行ファイルは**完全に最適化**された状態ではありません。

source: A Hash can have mixed types, both for the keys and values, meaning `K`/`V` will be union types, but these are determined when the hash is created, either by specifying `K` and `V` or by using a hash literal.
ja: ハッシュは異なる型を持つことが可能です。これは `K`/`V` それぞれが複数の型の組み合わせとなることを意味しています。ただ、それらの型はハッシュが作られたときに決定されます。つまり、ハッシュの生成時に明示的に指定された `K` と `T` か、

source: A Proc can be created from an existing method:
ja: 既存のメソッドから Proc を作ることもできます。

source: A String is typically created with a string literal, enclosing UTF-8 characters in double quotes:
ja: 通常、ダブルクォートで囲んだ UTF-8 文字の並びで文字列リテラルを記述します。

source: A [Char](http://crystal-lang.org/api/Char.html) represents a [Unicode](http://en.wikipedia.org/wiki/Unicode) [code point](http://en.wikipedia.org/wiki/Code_point).
ja: 文字 ([Char](http://crystal-lang.org/api/Char.html)) は [Unicode](http://en.wikipedia.org/wiki/Unicode) の[コードポイント](http://en.wikipedia.org/wiki/Code_point)を表したもので、

source: A [Hash](http://crystal-lang.org/api/Hash.html) representing a mapping of keys of a type `K` to values of a type `V`.
ja: ハッシュ ([Hash](http://crystal-lang.org/api/Hash.html)) は、`K` 型のキーと `V` 型の値のマッピングを表現するための型です。

source: A [Proc](http://crystal-lang.org/api/Proc.html) represents a function pointer with an optional context (the closure data).
ja: [Proc](http://crystal-lang.org/api/Proc.html) は関数ポインタを表すオブジェクトで、追加のコンテキスト (クロージャ) を含むことができます。

source: A [Range](http://crystal-lang.org/api/Range.html) is typically constructed with a range literal:
ja: 範囲 ([Range](http://crystal-lang.org/api/Range.html)) オブジェクトを作るには範囲リテラルを使います。

source: A [String](http://crystal-lang.org/api/String.html) represents an immutable sequence of UTF-8 characters.
ja: 文字列 ([String](http://crystal-lang.org/api/String.html)) は UTF-8 の文字の不変 (イミュータブル) なシーケンスを表したものです。

source: A [Symbol](http://crystal-lang.org/api/Symbol.html) is a constant that is identified by a name without you having to give it a numeric value.
ja: シンボル ([Symbol](http://crystal-lang.org/api/Symbol.html)) というのは、数値を与えることなく、その名前で識別することが可能な定数です。

source: A [Tuple](http://crystal-lang.org/api/Tuple.html) is typically created with a tuple literal:
ja: タプル ([Tuple](http://crystal-lang.org/api/Tuple.html)) を作るには、以下のタプルリテラルを使います。

source: A backslash can be used to denote some characters inside the string:
ja: 文字列中のいくつかの文字はバックスラッシュを使って表します。

source: A comment using `::` is used for showing the type of a variable.
ja: また、コメントの `::` は、変数の型を示すために利用されます。

source: A floating point literal is an optional `+` or `-` sign, followed by a sequence of numbers or underscores, followed by a dot, followed by numbers or underscores, followed by an optional exponent suffix, followed by an optional type suffix.
ja: 浮動小数点数リテラルは、`+` (オプション) または `-` 符号に続く数値とアンダースコア、そしてドット (`.`) と、またそれに続く数値とアンダースコアによって記述し、オプションで指数と型のサフィックスを与えます。

source: A method invocation that ends with `=` has syntax sugar:
ja: メソッド名が `=` で終わるメソッドの実行にもシンタックスシュガーがあります。

source: A proc can optionally specify a receiver:
ja: レシーバを指定することも可能です。

source: A regular expression literal is delimited by `/` and uses [PCRE](http://pcre.org/pcre.txt) syntax.
ja: 正規表現リテラルは `/` で区切られ、[PCRE](http://pcre.org/pcre.txt) の記法を使うことができます。

source: A slightly more interesting example is an HTTP Server:
ja: もう少し興味深いプログラムを見てみましょう。こちらは HTTP サーバーの例になります。

source: A special `new` method is provided too:
ja: また、`new` メソッドを使って作ることもできます。

source: A special notation allows creating hashes with string keys:
ja: キーが文字列である場合は、以下の特別な記法を使うことができます。

source: A special notation allows creating hashes with symbol keys:
ja: キーがシンボルである場合は、以下の特別な記法を使うことができます。

source: A string can span multiple lines:
ja: 文字列は複数の行にまたがって記述することができます。

source: Additionally, if your program reads a global variable before it was ever assigned a value it will also have the `Nil` type.
ja: また、それまでに何も代入されていないグローバル変数をプログラムが読み込んだとき、その値は常に `Nil` 型になります。

source: Alternative you can use the `run` command:
ja: また、`run` コマンドを使っても同様のことが可能です。

source: Alternatively, a backlash followed by a newline can be inserted inside the string literal:
ja: また、改行の前のバックスラッシュは文字列リテラルの中に書くこともできます。

source: An Array can have mixed types, meaning `T` will be a union of types, but these are determined when the array is created, either by specifying T or by using an array literal.
ja: 配列には異なる型の要素を含めることが可能で、そのとき `T` は複数の型の組み合わせとなります。ただ、その型は配列が作られたときに決定されます。つまり、配列の生成時に明示的に指定された `T` か、

source: An [Array](http://crystal-lang.org/api/Array.html) is a generic type containing elements of a type `T`.
ja: 配列 ([Array](http://crystal-lang.org/api/Array.html)) は、その中に `T` 型の n 個の要素を含むことができる汎用的な型です。

source: An alternative syntax is provided:
ja: また、以下の記法を利用して書くことも可能です。

source: An easy way to remember which one is inclusive and which one is exclusive it to think of the extra dot as if it pushes *y* further away, thus leaving it outside of the range.
ja: 上記の「右側の値を含む/含まない」記法の簡単な覚え方を紹介します。ドットが1つ多くついているから、それだけ *y* が遠くに押し出されているのをイメージしてください。だからそのとき遠くの *y* は範囲に含まれない、というわけです。

source: An integer literal is an optional `+` or `-` sign, followed by a sequence of digits and underscores, optionally followed by a suffix.
ja: 整数リテラルは、`+` (オプション) または `-` 符号に続く数値とアンダースコアによって記述し、オプションでサフィックスを与えます。

source: And it is also available to indexers (`[]=`):
ja: インデックス指定の代入 (`[]=`) の場合にも同様に有効です。

source: Arrays of strings can be created with a special syntax:
ja: 文字列の配列は特別な記法を使って書くことができます。

source: Arrays of symbols can be created with a special syntax:
ja: シンボルの配列は特別な記法を使って書くことができます。

source: Assignment is done with the equal (`=`) character.
ja: 代入にはイコール記号 (`=`) を使います。

source: Binary numbers start with `0b`:
ja: 先頭に `0b` をつけると2進数になります。

source: But Crystal is written in Crystal itself! So you first need to use one of the previous described methods to have a running compiler.
ja: 実は、Crystal は Crystal 自身によって書かれています！したがって、まずはこれまでに紹介した方法のいずれかを使ってコンパイラをインストールする必要があります。

source: Comments start with the sharp (`#`) character.
ja: 「`#`」の文字があると、その行はそれ以降がコメントになります。

source: Crystal files end with the `.cr` extension.
ja: Crystal のファイルには `.cr` という拡張子がつきます。

source: Crystal is a programming language that resembles Ruby but compiles to native code and tries to be much more efficient, at the cost of disallowing certain dynamic aspects of Ruby.
ja: Crystal は Ruby とよく似たプログラミング言語ですが、ネイティブコードにコンパイルし、Ruby よりずっと効率的に動作するものを目指しています。一方で、そのために Ruby が持っている動的な機能についてはいくらか制限されています。

source: Download the file for your platform and uncompress it.
ja: それぞれのプラットフォームに合わせて適切なファイルをダウンロードして展開してください。

source: Each of the above kinds of variables will be explained later on.
ja: 上記のそれぞれの変数の種類については改めて説明します。

source: First you have to add the repository to your APT configuration.
ja: まずは、公式の Crystal リポジトリを追加するために Apt を構成します。

source: First you have to add the repository to your YUM configuration.
ja: まずは、公式の Crystal リポジトリを追加するために Yum を構成します。

source: For easy setup just run in your command line:
ja: 簡単にその設定を行うためのスクリプトを用意していますので、以下のコマンドをそのまま実行してください。

source: For example
ja: 例をあげます。

source: For example, reassigning a variable with a different expression makes it have that expression’s type:
ja: 例えば、次のようにローカル変数に別の式を再代入すると、その新しい式の型の変数となります。

source: For example:
ja: 例:

source: From this you can see that the main routine is simply the program itself: there's no need to define a "main" function or something similar.
ja: このプログラムを見ればわかる通り、Crystal ではプログラム自体がメインルーチンとなります。つまり、「main」関数やそれに値するものを定義する必要はありません。

source: Global variables start with a dollar sign (`$`).
ja: 変数名の先頭にドル記号 (`$`) をつけるとグローバル変数になります。

source: Hexadecimal numbers start with `0x`:
ja: 先頭に `0x` をつけると16進数になります

source: If `MyType` is generic, the above is equivalent to this:
ja: もし `MyType` が汎用的な型である場合は、上記は以下と同じ意味です。

source: If `MyType` is not generic, the above is equivalent to this:
ja: もし `MyType` が汎用的な型でない場合は、上記は以下と同じ意味です。

source: If for any reason you can't or don't want to use one of the previous installation methods, you can still download Crystal in a standalone .tar.gz file with everything you need to get started.
ja: 何らかの理由で、これまで紹介した方法でインストールすることができない場合、.tar.gz ファイルをダウンロードする方法もあります。その中に、Crystal に必要なすべてのものが含まれています。

source: If no suffix is present, the literal's type is `Float64`.
ja: もしサフィックスがない場合は、リテラルの型は `Float64` になります。

source: If no suffix is present, the literal's type is the lowest betwen `Int32`, `Int64` and `UInt64` in which the number fits:
ja: もしサフィックスがない場合は、リテラルの型は `Int32`/`Int64`/`UInt64`のいずれかのうち、数値に合致する最も小さいものになります。

source: If the left-hand side contains just one variable, the right-hand side is considered an array:
ja: それでは、もし左辺に1つの変数しかないときはどうでしょうか。その場合には、右辺が配列であると解釈されます。

source: If the method has arguments, you must specify their types:
ja: 引数を持つメソッドの場合は、その型を指定する必要があります。

source: If the right-hand side contains just one expression, it is considered an indexed type and the following syntax sugar applies:
ja: もし代入文の右辺に1つの式しかないときにはどうなるのでしょうか。その場合には、インデックスを持つ型だと解釈され、以下のシンタックスシュガーが適用されます。

source: If you are using Mac and the Homebrew formula, this will be automatically configured for you if you install Crystal adding `--with-llvm` flag.
ja: もし Mac を使っていて Homebrew のフォーミュラからインストールする場合は、`--with-llvm` フラグを与えてインストールすれば LLVM が自動的に構成されます。

source: If you need to write a string that has many double quotes, parenthesis, or similar characters, you can use alternative literals:
ja: もし文字列にダブルクォートやカッコなどの文字が多く含まれている場合には、次のような形式でリテラルを書くこともできます。

source: If you prefer to do it manually execute:
ja: もし手動で構成したいのであれば、以下の操作を実行してください。

source: If you want to contribute then you might want to install Crystal from sources.
ja: もしコントリビュートしたいと考えているのであれば、Crystal をソースコードからインストールしたくなることと思います。

source: If you're planning to contribute to the project you might find useful to install LLVM as well.
ja: もしプロジェクトにコントリビュートしたいのであれば、同時に LLVM もインストールしておくとよいでしょう。

source: In Debian derived distributions, you can use the official Crystal repository.
ja: Debian 系のディストリビューションでは、公式の Crystal リポジトリを利用してインストールすることができます。

source: In RedHat derived distributions, you can use the official Crystal repository.
ja: RedHat 系のディストリビューションでは、公式の Crystal リポジトリを利用してインストールすることができます。

source: In code examples, the comment `#=>` is used to show the value of an expression.
ja: コードの例では、ある式の結果の値を示すために `#=>` というコメントを使用します。

source: In general, they are just value holders associated with the type that the programmer expects them to have according to their location and usage on the program.
ja: どういうことかというと、一般的にローカル変数というのは単純に型の情報を持った値の入れ物のようなものと考えることができて、プログラムにおけるそれぞれの場所や用途に応じてその入れ物の型も変化するということです。

source: In the case of a generic type, the type arguments can be specified too:
ja: 汎用的な型である場合には、型引数を指定することも可能です。

source: In the latter case, T will be set to the union of the array literal elements.
ja: 配列リテラルで生成した場合であれば、リテラルの要素の型の組み合わせによって型が決まります。

source: In the latter case, `K` will be set to the union of the hash literal keys, and `V` will be set to the union of the hash literal values.
ja: ハッシュリテラルで生成した場合であれば、リテラルのキーと値それぞれの型の組み合わせによって型が決まります。

source: In the next sections a dollar sign (`$`) denotes the command line.
ja: なお、以降ではドル記号 (`$`) でコマンドラインを示します。

source: In this case, leading whitespace is not included in the resulting string.
ja: この場合、先頭の空白が結果の文字列に含まれることはありません。

source: Inside it you will have a `bin/crystal` executable.
ja: その中に、`bin/crystal` という実行ファイルが含まれています。

source: Inside the repository you will also find a wrapper script at `bin/crystal`.
ja: リポジトリの中を見ると、`bin/crystal` というラッパースクリプトが存在することに気づくと思います。

source: Internally a symbol is represented as an `Int32`.
ja: 内部的には、シンボルは `Int32` で表現されます。

source: It can be followed by these modifiers:
ja: また、正規表現リテラルにはオプションを追加することも可能です。

source: It is created by enclosing an UTF-8 character in single quotes.
ja: UTF-8 の文字をシングルクォートで囲んで記述します。

source: It is typically created with a hash literal:
ja: 通常、以下のハッシュリテラルを利用して書きます。

source: It is typically created with a proc literal:
ja: 通常、Proc リテラルを使って生成します。

source: It is typically created with an array literal:
ja: 通常、以下の配列リテラルを利用して書きます。

source: It occupies 32 bits.
ja: そのビット数は32ビットです。

source: Let's start with two examples to familiarize ourselves with the language.
ja: それでは、まずはこれから紹介する2つのプログラムの例を見ながら、Crystal に親しんでいきましょう。

source: Local variables start with lowercase letters.
ja: 変数名の先頭が小文字の変数はローカル変数です。

source: Make sure to always use `--release` for production-ready executables and when performing benchmarks.
ja: したがって、プロダクションでの利用やベンチマークを測定するような場合には、必ず `--release` をつけるようにしてください。

source: Make sure to install [all the required libraries](https://github.com/manastech/crystal/wiki/All-required-libraries).
ja: ただし、 [「すべての必要なライブラリ」](https://github.com/manastech/crystal/wiki/All-required-libraries)がインストールされている必要があることに注意してください。

source: Multiple assignment is also available to methods that end with `=`:
ja: 多重代入は、メソッド名が `=` で終わるメソッドに対しても有効です。

source: Note that `||` and `&&` use the `[]?` method to check for key prescence.
ja: このとき、`||` と `&&` は、キーの存在チェックのために `[]?` メソッドを使うことに注意してください。

source: Note that because expressions are assigned to temporary variables it is possible to exchange variables’ contents in a single line:
ja: また、式は一時的な変数に代入される仕組みになっているため、次のように1行で変数の値を交換することも可能です。

source: Note that in the above example trailing and leading spaces, as well as newlines, end up in the resulting string.
ja: 上記の例で、先頭と末尾の空白、および改行が結果の文字列にも入っていることに注目してください。

source: Octal numbers start with a zero:
ja: 先頭にゼロをつけると8進数になります。

source: Once you [install](../installation/README.md) the compiler you will have a `crystal` binary at your disposal.
ja: [インストール](../installation/README.md)が済んでいれば、`crystal` というバイナリを利用することができます。
